export default async function Page() {
  return (
    <main className="overflow-hidden">
      <div className="mt-20 padding-x padding-y max-width">
        <h1 className="text-3xl font-extrabold">Пользовательское соглашение</h1>
        <p className="mt-4 text-lg leading-7">
          Настоящее Пользовательское соглашение (далее – «Соглашение»)
          регулирует отношения между вами (далее – «Пользователь») и сайтом
          EventPulse (далее – «Сайт»).
        </p>
        <h2 className="my-2 text-2xl font-bold">1. Общие положения</h2>
        <p className="mb-1 text-lg leading-7">
          1.1. Использование материалов и сервисов Сайта регулируется нормами
          действующего законодательства.
        </p>
        <p className="mb-1 text-lg leading-7">
          1.2. Настоящее Соглашение является публичной офертой. Получая доступ к
          материалам Сайта, Пользователь считается присоединившимся к настоящему
          Соглашению.
        </p>
        <h2 className="my-2 text-2xl font-bold">
          2. Права и обязанности сторон
        </h2>
        <p className="mb-1 text-lg leading-7">2.1. Пользователь имеет право:</p>
        <ul>
          <li className="mb-1 text-lg leading-7">
            Получать доступ к использованию Сайта;
          </li>
          <li className="mb-1 text-lg leading-7">
            Использовать все доступные на Сайте сервисы;
          </li>
          <li className="mb-1 text-lg leading-7">
            Задавать любые вопросы, относящиеся к услугам Сайта;
          </li>
        </ul>
        <p className="mb-1 text-lg leading-7">
          2.2. Администрация Сайта обязуется:
        </p>
        <ul>
          <li className="mb-1 text-lg leading-7">
            Поддерживать работу Сайта, за исключением случаев, когда это
            невозможно по независящим от Администрации причинам;
          </li>
          <li className="mb-1 text-lg leading-7">
            Осуществлять защиту информации, разглашение которой запрещено
            законом;
          </li>
        </ul>
        <h2 className="my-2 text-2xl font-bold">3. Ответственность сторон</h2>
        <p className="mb-1 text-lg leading-7">
          3.1. Пользователь самостоятельно несет ответственность за действия,
          связанные с использованием информации, полученной на Сайте.
        </p>
        <p className="mb-1 text-lg leading-7">
          3.2. Администрация Сайта не несет ответственности за ущерб, который
          может быть причинен Пользователю в результате использования материалов
          Сайта.
        </p>
        <h2 className="my-2 text-2xl font-bold">4. Заключительные положения</h2>
        <p className="mb-1 text-lg leading-7">
          4.1. Настоящее Соглашение вступает в силу с момента его акцепта
          Пользователем.
        </p>
        <p className="mb-1 text-lg leading-7">
          4.2. Администрация Сайта имеет право в одностороннем порядке изменять
          условия настоящего Соглашения в любое время. Изменения вступают в силу
          с момента их публикации на Сайте.
        </p>
      </div>
    </main>
  );
}
